sci-libs/Mutationpp/files/Mutationpp-1.0.5-respect-flags.patch
--- a/CMakeLists.txt
+++ b/CMakeLists.txt
@@ -131,7 +131,7 @@
 
 if (CMAKE_COMPILER_IS_GNUCXX)
     #set (CMAKE_CXX_FLAGS "-Wall -Wextra -Wno-unused-parameter -Wold-style-cast")
-    set (CMAKE_CXX_FLAGS "-g")
+    set (CMAKE_CXX_FLAGS "-g ${CMAKE_CXX_FLAGS}")
 endif ()
 
 if (${CMAKE_SYSTEM_NAME} MATCHES "Darwin")
@@ -152,13 +152,11 @@
 
     if (Fortran_COMPILER_NAME STREQUAL "gfortran")
         # gfortran
-        set (CMAKE_Fortran_FLAGS         "-fdefault-real-8")
-        set (CMAKE_Fortran_FLAGS_RELEASE "-O3")
+        set (CMAKE_Fortran_FLAGS         "-fdefault-real-8 ${CMAKE_Fortran_FLAGS}")
         set (CMAKE_Fortran_FLAGS_DEBUG   "-g")
     elseif (Fortran_COMPILER_NAME STREQUAL "ifort")
         # ifort (untested)
         set (CMAKE_Fortran_FLAGS         "-r8")
-        set (CMAKE_Fortran_FLAGS_RELEASE "-O3")
         set (CMAKE_Fortran_FLAGS_DEBUG   "-g -traceback -fpe0 -check all")
     endif()
 endif()
